data/onvif_mock_response.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope"
          xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery"
          xmlns:dn="http://www.onvif.org/ver10/network/wsdl">
  <Body>
    <d:ProbeMatches>
      <d:ProbeMatch>
        <d:EndpointReference>
          <d:Address>urn:uuid:a1b2c3d4-e5f6-7890-abcd-ef1234567890</d:Address>
        </d:EndpointReference>
        <d:Types>dn:NetworkVideoTransmitter</d:Types>
        <d:Scopes>
          onvif://www.onvif.org/type/video_encoder
          onvif://www.onvif.org/type/audio_encoder
          onvif://www.onvif.org/hardware/P3265-LVE
          onvif://www.onvif.org/name/AXIS%20P3265-LVE
          onvif://www.onvif.org/location/LoadingDockA
        </d:Scopes>
        <d:XAddrs>http://10.50.20.101:80/onvif/device_service</d:XAddrs>
        <d:MetadataVersion>1</d:MetadataVersion>
      </d:ProbeMatch>
      <d:ProbeMatch>
        <d:EndpointReference>
          <d:Address>urn:uuid:b2c3d4e5-f6a7-8901-bcde-f12345678901</d:Address>
        </d:EndpointReference>
        <d:Types>dn:NetworkVideoTransmitter</d:Types>
        <d:Scopes>
          onvif://www.onvif.org/type/video_encoder
          onvif://www.onvif.org/type/audio_encoder
          onvif://www.onvif.org/hardware/P3265-LVE
          onvif://www.onvif.org/name/AXIS%20P3265-LVE
          onvif://www.onvif.org/location/LoadingDockB
        </d:Scopes>
        <d:XAddrs>http://10.50.20.102:80/onvif/device_service</d:XAddrs>
        <d:MetadataVersion>1</d:MetadataVersion>
      </d:ProbeMatch>
      <d:ProbeMatch>
        <d:EndpointReference>
          <d:Address>urn:uuid:c3d4e5f6-a7b8-9012-cdef-123456789012</d:Address>
        </d:EndpointReference>
        <d:Types>dn:NetworkVideoTransmitter</d:Types>
        <d:Scopes>
          onvif://www.onvif.org/type/video_encoder
          onvif://www.onvif.org/hardware/Q6135-LE
          onvif://www.onvif.org/name/AXIS%20Q6135-LE
          onvif://www.onvif.org/location/ParkingLotNorth
        </d:Scopes>
        <d:XAddrs>http://10.50.20.103:80/onvif/device_service</d:XAddrs>
        <d:MetadataVersion>1</d:MetadataVersion>
      </d:ProbeMatch>
      <d:ProbeMatch>
        <d:EndpointReference>
          <d:Address>urn:uuid:d4e5f6a7-b8c9-0123-defa-234567890123</d:Address>
        </d:EndpointReference>
        <d:Types>dn:NetworkVideoTransmitter</d:Types>
        <d:Scopes>
          onvif://www.onvif.org/type/video_encoder
          onvif://www.onvif.org/type/audio_encoder
          onvif://www.onvif.org/hardware/P3265-LVE
          onvif://www.onvif.org/name/AXIS%20P3265-LVE
          onvif://www.onvif.org/location/WarehouseEntrance
        </d:Scopes>
        <d:XAddrs>http://10.50.20.104:80/onvif/device_service</d:XAddrs>
        <d:MetadataVersion>1</d:MetadataVersion>
      </d:ProbeMatch>
      <d:ProbeMatch>
        <d:EndpointReference>
          <d:Address>urn:uuid:e5f6a7b8-c9d0-1234-efab-345678901234</d:Address>
        </d:EndpointReference>
        <d:Types>dn:NetworkVideoTransmitter</d:Types>
        <d:Scopes>
          onvif://www.onvif.org/type/video_encoder
          onvif://www.onvif.org/hardware/Q6135-LE
          onvif://www.onvif.org/name/AXIS%20Q6135-LE
          onvif://www.onvif.org/location/ParkingLotSouth
        </d:Scopes>
        <d:XAddrs>http://10.50.20.105:80/onvif/device_service</d:XAddrs>
        <d:MetadataVersion>1</d:MetadataVersion>
      </d:ProbeMatch>
    </d:ProbeMatches>
  </Body>
</Envelope>
